In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 13, 0, 40, 37, 796000), 66, 'free', None, None, 514, 'Harrisburg-Carlisle, PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 13, 1, 12, 29, 796000), 51, 'free', None, None, 510, 'Houston-The Woodlands-Sugar Land, TX', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 13, 3, 19, 2, 796000), 9, 'free', None, None, 379, 'Eureka-Arcata-Fortuna, CA', 'Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like Gecko'),
 (5, datetime.datetime(2018, 11, 13, 3, 51, 52, 796000), 49, 'free', None, None, 506, 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (8, datetime.datetime(2018, 11, 13, 5, 0, 6, 796000), 94, 'free', None, None, 492, 'Ogden-Clearfield, UT', 'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:32.0) Gecko/20100101 Firefox/32.0')]

In [4]:
%sql SELECT count(*) FROM songplays

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(532,)]

In [5]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(66, 'Kevin', 'Arellano', 'M', 'free'),
 (51, 'Maia', 'Burke', 'F', 'free'),
 (9, 'Wyatt', 'Scott', 'M', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'free'),
 (94, 'Noah', 'Chavez', 'M', 'free')]

In [6]:
%sql SELECT count(*) FROM users

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(96,)]

In [7]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SONSKXP12A8C13A2C9', 'Native Soul', 'AR0IAWL1187B9A96D0', 2003, Decimal('197.19791')),
 ('SORRZGD12A6310DBC3', 'Harajuku Girls', 'ARVBRGZ1187FB4675A', 2004, Decimal('290.55955')),
 ('SOWQTQZ12A58A7B63E', 'Streets On Fire (Explicit Album Version)', 'ARPFHN61187FB575F6', 0, Decimal('279.97995')),
 ('SODREIN12A58A7F2E5', 'A Whiter Shade Of Pale (Live @ Fillmore West)', 'ARLTWXK1187FB5A3F8', 0, Decimal('326.00771')),
 ('SOFCHDR12AB01866EF', 'Living Hell', 'AREVWGE1187B9B890A', 0, Decimal('282.43546'))]

In [8]:
%sql SELECT count(*) FROM songs

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(71,)]

In [9]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR0IAWL1187B9A96D0', 'Danilo Perez', 'Panama', 8.4177, -80.11278),
 ('ARVBRGZ1187FB4675A', 'Gwen Stefani', '', None, None),
 ('ARPFHN61187FB575F6', 'Lupe Fiasco', 'Chicago, IL', 41.88415, -87.63241),
 ('ARLTWXK1187FB5A3F8', 'King Curtis', 'Fort Worth, TX', 32.74863, -97.32925),
 ('AREVWGE1187B9B890A', 'Bitter End', 'Noci (BA)', -13.442, -41.9952)]

In [10]:
%sql SELECT count(*) FROM artists

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(69,)]

In [11]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 13, 0, 40, 37, 796000), 0, 13, 46, 11, 2018, 1),
 (datetime.datetime(2018, 11, 13, 1, 12, 29, 796000), 1, 13, 46, 11, 2018, 1),
 (datetime.datetime(2018, 11, 13, 3, 19, 2, 796000), 3, 13, 46, 11, 2018, 1),
 (datetime.datetime(2018, 11, 13, 3, 51, 52, 796000), 3, 13, 46, 11, 2018, 1),
 (datetime.datetime(2018, 11, 13, 5, 0, 6, 796000), 5, 13, 46, 11, 2018, 1)]

In [12]:
%sql SELECT count(*) FROM time

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6813,)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`

Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

# Sanity Tests

Execute the cells below once you are ready to submit the project. Some basic sanity testing will be performed to esnure that your work does NOT contain any commonly found issues.

Run each cell and if a cell produces an warning message is orange, you should make appropriate changes to your code before submitting. If all test in a cell pass,no warnings will be printed.

The test cases assume that you are using certain column names in your tables. If you get a `IndexError: single positional indexer is out-of-bounds` you may need to change the column names being used by the test cases. Instructions for doing this appear right boefore cell that may require these changes.

The tests below are only meant to help you make your work foolproof. The submission will still be graded by a human grader against the project rubric.

---

## Grab Table Names for Testing

In [13]:
%load_ext autoreload
%autoreload 2

In [14]:
import sys
import logging
import warnings

from rich import traceback

In [15]:
src_path: str = "../src"
sys.path.append(src_path)
_ = traceback.install()
logging.basicConfig(force=True)
logging.getLogger().setLevel(logging.ERROR)
warnings.filterwarnings("ignore")

In [16]:
from sql_queries import get_insert_query, TABLES

In [17]:
%%sql _tablenames <<
SELECT tablename
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND schemaname != 'information_schema' AND tableowner = 'student';

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.
Returning data to local variable _tablenames

In [18]:
tablenames = _tablenames.DataFrame()

In [19]:
user_table = (  # [name for name in list(tablenames.tablename) if name in sqlq.user_table_create][0]
    "users"
)
song_table = (  # [name for name in list(tablenames.tablename) if name in sqlq.song_table_create][0]
    "songs"
)
artists_table = (  # [name for name in list(tablenames.tablename) if name in sqlq.artist_table_create][0]
    "artists"
)
songplay_table = (  # [name for name in list(tablenames.tablename) if name in sqlq.songplay_table_create][0]
    "songplays"
)

## Run Primary Key Tests

In [20]:
%sql _output << SELECT a.attname, format_type(a.atttypid, a.atttypmod) AS data_type, a.attnotnull, i.indisprimary \
FROM   pg_index i \
JOIN   pg_attribute a ON a.attrelid = i.indrelid \
                     AND a.attnum = ANY(i.indkey) \
WHERE  i.indrelid = '{user_table}'::regclass

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
Returning data to local variable _output

In [21]:
if not _output:
    print(
        "\033[93m"
        + "[WARNING] "
        + f"The {user_table} table does not have a primary key!"
    )

In [22]:
%sql _output << SELECT a.attname, format_type(a.atttypid, a.atttypmod) AS data_type, a.attnotnull, i.indisprimary \
FROM   pg_index i \
JOIN   pg_attribute a ON a.attrelid = i.indrelid \
                     AND a.attnum = ANY(i.indkey) \
WHERE  i.indrelid = '{artists_table}'::regclass

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
Returning data to local variable _output

In [23]:
if not _output:
    print(
        "\033[93m"
        + "[WARNING] "
        + f"The {artists_table} table does not have a primary key!"
    )

In [24]:
%sql _output << SELECT a.attname, format_type(a.atttypid, a.atttypmod) AS data_type, a.attnotnull, i.indisprimary \
FROM   pg_index i \
JOIN   pg_attribute a ON a.attrelid = i.indrelid \
                     AND a.attnum = ANY(i.indkey) \
WHERE  i.indrelid = '{songplay_table}'::regclass

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
Returning data to local variable _output

In [25]:
if not _output:
    print(
        "\033[93m"
        + "[WARNING] "
        + f"The {songplay_table} table does not have a primary key!"
    )

In [26]:
%sql _output << SELECT a.attname, format_type(a.atttypid, a.atttypmod) AS data_type, a.attnotnull, i.indisprimary \
FROM   pg_index i \
JOIN   pg_attribute a ON a.attrelid = i.indrelid \
                     AND a.attnum = ANY(i.indkey) \
WHERE  i.indrelid = '{song_table}'::regclass

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
Returning data to local variable _output

In [27]:
if not _output:
    print(
        "\033[93m"
        + "[WARNING] "
        + f"The {song_table} table does not have a primary key!"
    )

## Run Data Type and Constraints Check

In [28]:
%sql _output << SELECT * FROM information_schema.columns where table_name='{user_table}'

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.
Returning data to local variable _output

**Check the column `user_id` for correct data type.**
If you get a `IndexError: single positional indexer is out-of-bounds` error, you may be using a different column name. Change the column name below and run the cell again.

In [29]:
output = _output.DataFrame()
_dtype = output[output.column_name == "user_id"].data_type.iloc[0]
if _dtype not in ["integer", "bigint"]:
    print(
        "\033[93m"
        + "[WARNING] "
        + f"Type {_dtype} may not be an appropriate data type for column 'user_id' in"
        f" the '{user_table}' table."
    )

In [30]:
%sql _output << SELECT * FROM information_schema.columns where table_name='{song_table}'

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.
Returning data to local variable _output

**Check the column `year` for correct data type.
Check columns `title` and `duration` for not-NULL constraints.**

If you get a `IndexError: single positional indexer is out-of-bounds` error, you may be using different column names. Change the column name(s) below and run the cell again.

In [31]:
output = _output.DataFrame()

_dtype = output[output.column_name == "year"].data_type.iloc[0]
if _dtype not in ["integer"]:
    print(
        "\033[93m"
        + "[WARNING] "
        + f"Type '{_dtype}' may not be an appropriate data type for column 'year' in"
        f" the '{song_table}' table."
    )

_nullable_title = output[output.column_name == "title"].is_nullable.iloc[0]
_nullable_duration = output[output.column_name == "duration"].is_nullable.iloc[0]
if (_nullable_duration != "NO") or (_nullable_title != "NO"):
    print(
        "\033[93m"
        + "[WARNING] "
        + f"You may want to add appropriate NOT NULL constraints to the '{song_table}'"
        " table."
    )

In [32]:
%sql _output << SELECT * FROM information_schema.columns where table_name='{artists_table}'

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.
Returning data to local variable _output

**Check the columns `latitude` and `longitude` for correct data type.
Check column `name` for not-NULL constraint.**

If you get a `IndexError: single positional indexer is out-of-bounds` error, you may be using different column names. Change the column name(s) below and run the cell again.

In [33]:
output = _output.DataFrame()

_dtype_latitude = output[output.column_name == "latitude"].data_type.iloc[0]
if _dtype_latitude not in ["double precision"]:
    print(
        "\033[93m"
        + "[WARNING] "
        + f"Type '{_dtype_latitude}' may not be an appropriate data type for column"
        f" 'latitude' in the '{artists_table}' table"
    )

_dtype_longitude = output[output.column_name == "longitude"].data_type.iloc[0]
if _dtype_longitude not in ["double precision"]:
    print(
        "\033[93m"
        + "[WARNING] "
        + f"Type '{_dtype_longitude}' may not be an appropriate data type for column"
        f" 'longitude' in the '{artists_table}' table"
    )


_nullable_name = output[output.column_name == "name"].is_nullable.iloc[0]
if _nullable_name != "NO":
    print(
        "\033[93m"
        + "[WARNING] "
        + "You may want to add appropriate NOT NULL constraints to the"
        f" '{artists_table}' table."
    )

In [34]:
%sql _output << SELECT * FROM information_schema.columns where table_name='{songplay_table}'

 * postgresql://student:***@127.0.0.1/sparkifydb
9 rows affected.
Returning data to local variable _output

**Check the columns `start_time` and `user_id` for correct data type.
Check columns `start_time` and `user_id` for not-NULL constraint.**

If you get a `IndexError: single positional indexer is out-of-bounds` error, you may be using different column names. Change the column name(s) below and run the cell again.

In [35]:
output = _output.DataFrame()

_dtype_start_time = output[output.column_name == "start_time"].data_type.iloc[0]
if "timestamp" not in _dtype_start_time:
    print(
        "\033[93m"
        + "[WARNING] "
        + f"Type '{_dtype_start_time}' may not be an appropriate data type for column"
        f" 'start_time' in the '{songplay_table}' table."
    )

_dtype_user_id = output[output.column_name == "user_id"].data_type.iloc[0]
if _dtype_user_id not in ["integer", "bigint"]:
    print(
        "\033[93m"
        + "[WARNING] "
        + f"Type '{_dtype_user_id}' may not be an appropriate data type for column"
        f" 'user_id' in the '{songplay_table}' table."
    )


_nullable_time = output[output.column_name == "start_time"].is_nullable.iloc[0]
_nullable_uid = output[output.column_name == "user_id"].is_nullable.iloc[0]

if (_nullable_time != "NO") or (_nullable_uid != "NO"):
    print(
        "\033[93m"
        + "[WARNING] "
        + "You may want to add appropriate NOT NULL constraints to the"
        f" '{songplay_table}' table."
    )

## Run Tests for Upsertion Check

In [36]:
import re

In [37]:
songplay_table_insert = get_insert_query(
    "songplays",
    (
        "songplay_id",
        "start_time",
        "user_id",
        "level",
        "song_id",
        "artist_id",
        "session_id",
        "location",
        "user_agent",
    ),
    conflict_nothing_cols=("songplay_id",),
)
user_table_insert = get_insert_query(
    "users",
    ("user_id", "first_name", "last_name", "gender", "level"),
    conflict_nothing_cols=("user_id",),
)
song_table_insert = get_insert_query(
    "songs",
    ("song_id", "title", "artist_id", "year", "duration"),
    conflict_nothing_cols=("song_id",),
)
artist_table_insert = get_insert_query(
    "artists",
    ("artist_id", "name", "location", "latitude", "longitude"),
    conflict_nothing_cols=("artist_id",),
)

In [38]:
if (
    not re.search("ON\s+CONFLICT", songplay_table_insert, re.IGNORECASE)
    or not re.search("ON\s+CONFLICT", user_table_insert, re.IGNORECASE)
    or not re.search("ON\s+CONFLICT", song_table_insert, re.IGNORECASE)
    or not re.search("ON\s+CONFLICT", artist_table_insert, re.IGNORECASE)
):
    print(
        "\033[93m"
        + '[WARNING]Some of your insert queries may need an "ON CONFLICT" clause.'
    )
    print(
        "\033[93m"
        + '         You can either skip conflicting insertions with with "ON CONFLICT'
        ' DO NOTHING"'
    )
    print("\033[93m" + '         OR use "ON CONFLICT DO UPDATE SET"')
    print(
        "\033[93m" + "         Check this link for more details:"
        " https://www.postgresqltutorial.com/postgresql-upsert/"
    )

## Custom checks (must be run after notebook restart)

In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
import os
import sys
import glob
import psycopg2
import pandas as pd
import logging
import warnings

from rich import traceback
from pathlib import Path
from IPython.core import display as ICD

In [3]:
src_path: str = "../src"
sys.path.append(src_path)
_ = traceback.install()
logging.basicConfig(force=True)
logging.getLogger().setLevel(logging.ERROR)
warnings.filterwarnings("ignore")

In [4]:
from create_tables import main as run_create_tables
from etl import main as run_etl, get_insert_query
from sql_queries import get_simple_select_query, TABLES

### Table creation

Table creation script runs without errors.

In [5]:
run_create_tables()

Fact and dimensional tables for a star schema are properly defined.

In [6]:
conn = psycopg2.connect(
    "host=127.0.0.1 dbname=sparkifydb user=student password=student"
)
cur = conn.cursor()
query_columns = ("table_name", "column_name", "data_type")


for table_name in TABLES.keys():
    cur.execute(
        get_simple_select_query(
            query_columns,
            "information_schema.columns",
            {"table_name": f"'{table_name}'"},
        )
    )
    conn.commit()
    print(f"Description of table {table_name}:")
    ICD.display(
        pd.DataFrame(cur.fetchall(), columns=query_columns)
        .set_index("column_name")["data_type"]
        .to_frame()
    )
    print("\n\n")

conn.commit()
conn.close()

Description of table users:

            data_type
column_name
user_id       integer
first_name       text
last_name        text
gender           text
level            text

Description of table artists:

                    data_type
column_name
latitude     double precision
longitude    double precision
artist_id                text
name                     text
location                 text

Description of table songs:

            data_type
column_name
year          integer
duration      numeric
song_id          text
title            text
artist_id        text

Description of table time:

                               data_type
column_name
start_time   timestamp without time zone
hour                             integer
day                              integer
week                             integer
month                            integer
year                             integer
weekday                          integer

Description of table songplays:

                               data_type
column_name
start_time   timestamp without time zone
session_id                       integer
user_id                          integer
songplay_id                      integer
location                            text
user_agent                          text
level                               text
song_id                             text
artist_id                           text

### ETL

ETL script runs without errors.

In [7]:
run_etl()

Output()

Output()

ETL script properly processes transformations in Python.

In [8]:
conn = psycopg2.connect(
    "host=127.0.0.1 dbname=sparkifydb user=student password=student"
)
cur = conn.cursor()
query_columns = ("table_name", "column_name", "data_type")


for table_name in TABLES.keys():
    cur.execute(
        get_simple_select_query(
            query_columns,
            "information_schema.columns",
            {"table_name": f"'{table_name}'"},
        )
    )
    conn.commit()

    table_columns = pd.DataFrame(cur.fetchall(), columns=query_columns)["column_name"]

    cur.execute(get_simple_select_query(("*",), table_name, limit=5))
    conn.commit()
    print(f"Description of table {table_name}:")
    ICD.display(pd.DataFrame(cur.fetchall(), columns=table_columns))
    print("\n\n")

cur.close()
conn.close()

Description of table users:

column_name  user_id first_name last_name gender level
0                 66      Kevin  Arellano      M  free
1                 51       Maia     Burke      F  free
2                  9      Wyatt     Scott      M  free
3                 49      Chloe    Cuevas      F  free
4                 94       Noah    Chavez      M  free

Description of table artists:

column_name,latitude,longitude,artist_id,name,location
0,AR0IAWL1187B9A96D0,Danilo Perez,Panama,8.41770,-80.11278
1,ARVBRGZ1187FB4675A,Gwen Stefani,,NaN,NaN
2,ARPFHN61187FB575F6,Lupe Fiasco,"Chicago, IL",41.88415,-87.63241
3,ARLTWXK1187FB5A3F8,King Curtis,"Fort Worth, TX",32.74863,-97.32925
4,AREVWGE1187B9B890A,Bitter End,Noci (BA),-13.44200,-41.99520

Description of table songs:

column_name,year,duration,song_id,title,artist_id
0,SONSKXP12A8C13A2C9,Native Soul,AR0IAWL1187B9A96D0,2003,197.19791
1,SORRZGD12A6310DBC3,Harajuku Girls,ARVBRGZ1187FB4675A,2004,290.55955
2,SOWQTQZ12A58A7B63E,Streets On Fire (Explicit Album Version),ARPFHN61187FB575F6,0,279.97995
3,SODREIN12A58A7F2E5,A Whiter Shade Of Pale (Live @ Fillmore West),ARLTWXK1187FB5A3F8,0,326.00771
4,SOFCHDR12AB01866EF,Living Hell,AREVWGE1187B9B890A,0,282.43546

Description of table time:

column_name              start_time  hour  day  week  month  year  weekday
0           2018-11-13 00:40:37.796     0   13    46     11  2018        1
1           2018-11-13 01:12:29.796     1   13    46     11  2018        1
2           2018-11-13 03:19:02.796     3   13    46     11  2018        1
3           2018-11-13 03:51:52.796     3   13    46     11  2018        1
4           2018-11-13 05:00:06.796     5   13    46     11  2018        1

Description of table songplays:

column_name,start_time,session_id,user_id,songplay_id,location,user_agent,level,song_id,artist_id
0,1,2018-11-13 00:40:37.796,66,free,None,None,514,"Harrisburg-Carlisle, PA","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."
1,3,2018-11-13 01:12:29.796,51,free,None,None,510,"Houston-The Woodlands-Sugar Land, TX","""Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebK..."
2,4,2018-11-13 03:19:02.796,9,free,None,None,379,"Eureka-Arcata-Fortuna, CA",Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7....
3,5,2018-11-13 03:51:52.796,49,free,None,None,506,"San Francisco-Oakland-Hayward, CA",Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20...
4,8,2018-11-13 05:00:06.796,94,free,None,None,492,"Ogden-Clearfield, UT",Mozilla/5.0 (Windows NT 6.1; WOW64; rv:32.0) G...

### Example additional queries

In [9]:
conn = psycopg2.connect(
    "host=127.0.0.1 dbname=sparkifydb user=student password=student"
)
cur = conn.cursor()

**How many records are in each table?**

In [10]:
from sql_queries import TABLES

for table_name in TABLES.keys():
    cur.execute(f"SELECT count(*) FROM {table_name}")
    print(f"{table_name} has {cur.fetchone()[0]} records.")

users has 96 records.
artists has 69 records.
songs has 71 records.
time has 6813 records.
songplays has 532 records.

**Who are the top 5 users with the highest activity?**

In [11]:
cur.execute(
    """
    SELECT
        t.user_id, users.first_name, users.last_name, t.counted
    FROM
        (
            SELECT
                songplays.user_id, count(*) AS counted
            FROM
                (songplays JOIN users ON songplays.user_id = users.user_id)
            GROUP BY
                songplays.user_id
        ) t
    JOIN
        users ON t.user_id = users.user_id
    ORDER BY
        t.counted DESC, user_id
    LIMIT 5
    """
)
pd.DataFrame(cur.fetchall(), columns=("user_id", "first_name", "second_name", "count"))

   user_id  first_name second_name  count
0       29  Jacqueline       Lynch    104
1       97        Kate     Harrell     68
2       95        Sara     Johnson     67
3       49       Chloe      Cuevas     66
4       44      Aleena       Kirby     62

In [12]:
cur.close()
conn.close()